
##### 본 테스트 문제 알고리즘 - 1
'''
# 여러 화살표가 나열되어 있는 문자열 N이 주어진다.
# 좌측 화살표는 -1, 양쪽 화살표는 0, 우측 화살표는 1이라 칭하고, '-'의 개수를 해당 화살표의 길이라고 할 때,
# 문자열 N 내의 화살표들을 [종류,길이] 형태로 리턴하라.
# 예를 들어, 문자열 N이 '--->---><----->'으로 주어질 경우, [[1,3],[1,3],[0,5]]를 리턴하라.
'''

##### 본 테스트 문제 알고리즘 - 2
'''
# 로봇의 자가발전 능력 E(T당 충전량), T(시간)와
# 각 충전소의 충전 능력이 담긴 배열 ELEC = ex.[1,3,2,1,1]과 
# 충전소 사이의 거리가 담긴 배열 DIST = ex.[4,4,3,3]가 주어진다.
# 로봇은 반드시 1초에 1의 거리를 이동하고, 1의 거리를 이동할 때 전력 1을 사용할 때,
# 끝 지점에 도착하게 되는 최단 시간과, 그 때의 충전 잔량을 [최단 시간, 충전 잔량] 형태로 리턴하라. 
'''

##### 본 테스트 문제 알고리즘 - 3

# 회전문


##### 본 테스트 문제 알고리즘 - 4

# 각 빌딩을 모두 방문하고, 건물 1에 주차를 할 때 주차비용


##### 본 테스트 문제 SQL - 1
'''
# 테이블 'Soccer_Team'과 'Game_Record'가 주어질 때,
# 각 팀의 골득실차를 구하는 쿼리를 작성하라.
'''